The [Tap] must be attached to pipe.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId FittingMustBeOnPipe { get; }
  Visual Basic
Public Shared ReadOnly Property FittingMustBeOnPipe As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FittingMustBeOnPipe {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures ConnectorFailures Class
  Autodesk.Revit.DB Namespace